# Parameter Type Id Rebar Bar Crank Lengths Property

Source: https://www.revitapidocs.com/2026/0d9f8239-6681-7dd5-a59d-b982d8f0f500.htm

---

| Parameter Type Id Rebar Bar Crank Lengths Property |
| --- |

"Crank Lengths"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarBarCrankLengths { get; }
```

```
Public Shared ReadOnly Property RebarBarCrankLengths As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarBarCrankLengths {
	ForgeTypeId^ get ();
}
```

```
static member RebarBarCrankLengths : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace